Repository: shelsonx/ft_transcendence
Catalog: backend/services/auth/locale/*/LC_MESSAGES/django.po
Languages: fr, pt_br

source: field already exists
fr: le champ existe déjà
pt_br: campo já existe

source: bad credentials
fr: Mauvaises informations d'identification
pt_br: Credenciais Inválidas

source: Unauthorized
fr: Non autorisé
pt_br: Não Autorizado

source: Forbidden
fr: Interdit
pt_br: Proibido

source: Invalid Access Token
fr: Jeton d'accès invalide
pt_br: Token de Acesso Inválido

source: Token Expired
fr: Token expiré
pt_br: Token Expirou

source: Two factor code required
fr: Code à deux facteurs requis
pt_br: Código de dois fatores necessário

source: User is inactive, you must confirm the code by e-mail
fr: L'utilisateur est inactif, vous devez confirmer le code par e-mail
pt_br: Usuário está inativo, você deve confirmar o código por e-mail

source: User not found
fr: Utilisateur non trouvé
pt_br: Usuário não encontrado

source: You need to wait %(seconds_to_wait)s seconds before sending a new code
fr: Vous devez attendre %(seconds_to_wait)s secondes avant d'envoyer un nouveau code
pt_br: Você precisa esperar %(seconds_to_wait)s segundos antes de enviar um novo código

source: Password is required for email sign up
fr: Le mot de passe est requis pour l'inscription par e-mail
pt_br: Senha é necessária para cadastro por e-mail

source: Transcendence Journey - Two Factor Authentication
fr: Transcendence Journey - Authentification à deux facteurs
pt_br: Transcendence Journey - Autenticação de Dois Fatores

source: Your two factor authentication code is %(code)s
fr: Votre code d'authentification à deux facteurs est %(code)s
pt_br: Votre code d'authentification à deux facteurs est %(code)s

source: old password is missing
fr: ancien mot de passe manquant
pt_br: senha antiga está faltando

source: Invalid two factor code
fr: Code à deux facteurs invalide
pt_br: Código de dois fatores inválido

source: Forbidden access to this login type
fr: Accès interdit à ce type de connexion
pt_br: Acesso proibido para este tipo de login

source: This password must contain at least %(lower_case_min)d character(s) in lowercase.
fr: Ce mot de passe doit contenir au moins %(lower_case_min)d caractère(s) en minuscules.
pt_br: Esta senha deve conter pelo menos %(lower_case_min)d caractere(s) em minúsculas.

source: Your password must contain at least %(lower_case_min)d character(s) in lowercase.
fr: Votre mot de passe doit contenir au moins %(lower_case_min)d caractère(s) en minuscules.
pt_br: Sua senha deve conter pelo menos %(lower_case_min)d caractere(s) em minúsculas.

source: This password must contain at least %(min_length)d characters.
fr: Ce mot de passe doit contenir au moins %(min_length)d caractères.
pt_br: Esta senha deve conter pelo menos %(min_length)d caracteres.

source: Your password must contain at least %(min_length)d characters.
fr: Votre mot de passe doit contenir au moins %(min_length)d caractères.
pt_br: Sua senha deve conter pelo menos %(min_length)d caracteres.

source: This password must contain at least %(upper_case_min)d character(s) in uppercase.
fr: Ce mot de passe doit contenir au moins %(upper_case_min)d caractère(s) en majuscules.
pt_br: Esta senha deve conter pelo menos %(upper_case_min)d caractere(s) em maiúsculas.

source: Your password must contain at least %(upper_case_min)d character(s) in uppercase.
fr: Votre mot de passe doit contenir au moins %(upper_case_min)d caractère(s) en majuscules.
pt_br: Sua senha deve conter pelo menos %(upper_case_min)d caractere(s) em maiúsculas.

source: Password is valid
fr: Le mot de passe est valide
pt_br: Senha é válida

source: Transcendence Journey - Two Factor Authentication (Game Authentication)
fr: Transcendence Journey - Authentification à deux facteurs (Authentification de jeu)
pt_br: Transcendence Journey - Autenticação de Dois Fatores (Autenticação do Jogo)

source: The user_receiver_id field must be an array of uuids.
fr: Le champ user_receiver_id doit être un tableau de uuids.
pt_br: O campo user_receiver_id deve ser um array de uuids.

source: The user_receiver_id field must contain at most %(max_uuids)d uuids.
fr: Le champ user_receiver_id doit contenir au maximum %(max_uuids)d
pt_br: O campo user_receiver_id deve conter no máximo %(max_uuids)d

source: The user_receiver_id field must contain only valid uuids.
fr: Le champ user_receiver_id doit contenir uniquement des uuids valides.
pt_br: O campo user_receiver_id deve conter apenas uuids válidos.

source: Invalid email list
fr: Liste d'e-mails invalide

source: The code_user_receiver_id field must be an array of code and uuids.
fr: Le champ code_user_receiver_id doit être un tableau de code et uuids.

source: Two factor code not founds %(codes)s
fr: Code à deux facteurs introuvable %(codes)s

source: Only Two players are allowed to this mode of game
fr: Seuls deux joueurs sont autorisés à ce mode de jeu
