Repository: shelsonx/ft_transcendence
Catalog: backend/services/game/locale/*/LC_MESSAGES/django.po
Languages: fr, pt_br

source: Challenge tournament can have only 2 players
fr: Le tournoi de Défi ne peut avoir que 2 joueurs
pt_br: O torneio tipo Desafio pode ter apenas 2 jogadores

source: Challenge tournament must have at least 3 rounds
fr: Le tournoi de Défi doit avoir au moins 3 rounds
pt_br: O torneio tipo Desafio deve ter pelo menos 3 rodadas

source: The code was sent to the email registered by the user
fr: Le code a été envoyé à l'email enregistré par l'utilisateur
pt_br: O token foi enviado para o e-mail registrado pelo usuário

source: Games
fr: Jeux
pt_br: Jogos

source: Game date
fr: Date du jeu
pt_br: Data do jogo

source: Game status
fr: Statut du jeu
pt_br: Status do jogo

source: Game Rules
fr: Règles du jeu
pt_br: Regras do jogo

source: Game
fr: Jeu
pt_br: Jogo

source: Player' score in the game
fr: Score du joueur dans le jeu
pt_br: Pontuação do jogador no jogo

source: Left
fr: Gauche
pt_br: Esquerda

source: Right
fr: Droite
pt_br: Direita

source: Player winner points
fr: Points du joueur gagnant
pt_br: Pontos para vencer

source: Game total points
fr: Points totaux du jeu
pt_br: Soma dos pontos no jogo

source: Game duration
fr: Durée du jeu
pt_br: Duração do jogo

source: Game rule type
fr: Type de règle du jeu
pt_br: Tipo de regra

source: Points to win
fr: Points pour gagner
pt_br: Pontos para vencer

source: Game maximum duration
fr: Durée maximale du jeu
pt_br: Duração máxima do jogo

source: Tournament Status
fr: Statut du Tournoi
pt_br: Status

source: Round {self.round_number}
fr: Tour {self.round_number}
pt_br: Rodada {self.round_number}

source: Pending confirmation
fr: Confirmation en attente
pt_br: Aguardando confirmação

source: Scheduled
fr: Programmé
pt_br: Agendado

source: Ongoing
fr: En cours
pt_br: Em andamento

source: Paused
fr: En pause
pt_br: Pausado

source: Ended
fr: Terminé
pt_br: Finalizado

source: Canceled
fr: Annulé
pt_br: Cancelado

source: Waiting all players confirmation
fr: En attente de la confirmation de tous les joueurs
pt_br: Aguardando confirmação dos participantes

source: On going
fr: En cours
pt_br: Em andamento

source: Didn't started
fr: N'a pas commencé
pt_br: Não iniciado

source: Pending
fr: En attente
pt_br: Pendente

source: Accepted
fr: Accepté
pt_br: Aceito

source: Tournament Type
fr: Type de tournoi
pt_br: Tipo de torneio

source: Tournament date
fr: Date du tournoi
pt_br: Data

source: Tournament Rules
fr: Règles du tournoi
pt_br: Regras

source: Tournament Players
fr: Joueurs du tournoi
pt_br: Jogadores

source: Tournament
fr: Tournoi
pt_br: Torneio

source: Alias name
fr: Alias
pt_br: Nome no torneio

source: Rating
fr: Classement
pt_br: Classificação

source: Challenge
fr: Défi
pt_br: Desafio

source: Round-robin
fr: Tous contre tous
pt_br: Todos contra todos

source: %(value)s is not an odd number
fr: %(value)s n'est pas un nombre impair
pt_br: %(value)s não é um número ímpar

source: User does not exist
fr: L'utilisateur n'existe pas
pt_br: Usuário não cadastrado

source: You can't play against yourself
fr: Vous ne pouvez pas jouer contre vous-même
pt_br: Você não pode jogar contra você mesmo

source: An internal error occured while creating the game
fr: Une erreur interne est survenue lors de la création du jeu
pt_br: Ocorreu um erro interno ao criar o jogo

source: English
fr: Anglais
pt_br: Inglês

source: French
fr: Français
pt_br: Francês

source: Brazilian Portuguese
fr: Portugais brésilien
pt_br: Português do Brasil

source: Customize Game Rules
fr: Personnaliser les règles du jeu
pt_br: Personalizar regras do jogo

source: Use Default Rules
fr: Utiliser les règles par défaut
pt_br: Usar regras padrão

source: Choose an oponent:
fr: Choisir un adversaire :
pt_br: Escolha um oponente:

source: Invite
fr: Inviter
pt_br: Convidar

source: Customize Tournament's Games Rules
fr: Personnaliser les règles des jeux du tournoi
pt_br: Personalizar regras dos jogos do torneio

source: Add another player
fr: Ajouter un autre joueur
pt_br: Adicionar outro jogador

source: Create tournament
fr: Créer un tournoi
pt_br: Criar torneio

source: The Transcendence Journey's Pong Game Rules
fr: Règles du jeu Pong du The Transcendence Journey
pt_br: Regras do Pong do The Transcendence Journey

source: To move your paddle up and down, use respectively the keyboard keys:
fr: Pour déplacer votre raquette vers le haut et vers le bas, utilisez respectivement les touches du clavier:
pt_br: Para mover sua raquete para cima e para baixo, use as teclas do teclado:

source: <span class="text-emphasis"><strong>W</strong></span> and <span class="text-emphasis"><strong>S</strong></span> for left player
fr: <span class="text-emphasis"><strong>W</strong></span> et <span class="text-emphasis"><strong>S</strong></span> pour le joueur de gauche
pt_br: <span class="text-emphasis"><strong>W</strong></span> e <span class="text-emphasis"><strong>S</strong></span> para o jogador da esquerda

source: <span class="text-emphasis"><strong>ArrowUp</strong></span> and <span class="text-emphasis"><strong>ArrowDown</strong></span> for right player
fr: <span class="text-emphasis"><strong>flèche vers le haut</strong></span> et <span class="text-emphasis"><strong>flèche vers le bas</strong></span> pour le joueur de droite
pt_br: <span class="text-emphasis"><strong>ArrowUp</strong></span> e <span class="text-emphasis"><strong>ArrowDown</strong></span> para o jogador da direita

source: Game ends when a player riches <span class="text-emphasis"><strong>11 points</strong></span>.
fr: Le jeu se termine lorsqu'un joueur atteint <span class="text-emphasis"><strong>11 points</strong></span>.
pt_br: O jogo termina quando um jogador faz <span class="text-emphasis"><strong>11 pontos</strong></span>.

source: You may customize this value or change how the game ends, considering:
fr: Vous pouvez personnaliser cette valeur ou modifier la façon dont le jeu se termine, en considérant:
pt_br: Você pode personalizar este valor ou mudar como o jogo termina, considerando:

source: game total points
fr: points totaux du jeu
pt_br: a soma dos pontos no jogo

source: game duration
fr: durée du jeu
pt_br: tempo de duração do jogo

source: Ranking:
fr: Classement
pt_br: Classificação

source: Winnings:
fr: Gains
pt_br: Vitórias

source: Losses:
fr: Pertes
pt_br: Derrotas

source: Ties:
fr: Cravates
pt_br: Empates

source: Matches:
fr: Jeux
pt_br: Total de Jogos

source: Total points in games:
fr: Total de points dans les jeux
pt_br: Total de pontos em jogos:

source: Average points per game:
fr: Moyenne de points par match
pt_br: Média de pontos por jogo

source: Tournaments:
fr: Tournois
pt_br: Torneios

source: Points in tournaments:
fr: Points dans les tournois
pt_br: Pontos em torneios

source: Other statistics
fr: Autres statistiques
pt_br: Outras estatísticas

source: Maximum points in a game:
fr: Maximum de points dans un jeu

source: Longest game:
fr: Jeu le plus long
pt_br: Jogo mais longo:

source: Fastest game:
fr: Jeu le plus rapide
pt_br: Jogo mais rápido:

source: Your Transcendence Journey's Pong Game Rules
fr: Règles de votre Pong jeu
pt_br: Regras do seu Transcendence Journey Pong

source: <span class="text-emphasis"><strong>W</strong></span> and <span class="text-emphasis"><strong>S</strong></span> for left player
fr: <span class="text-emphasis"><strong>W</strong></span> et <span class="text-emphasis"><strong>S</strong></span> pour le joueur de gauche
pt_br: <span class="text-emphasis"><strong>W</strong></span> e <span class="text-emphasis"><strong>S</strong></span> para o jogador da esquerda

source: <span class="text-emphasis"><strong>ArrowUp</strong></span> and <span class="text-emphasis"><strong>ArrowDown</strong></span> for right player
fr: <span class="text-emphasis"><strong>ArrowUp</strong></span> et <span class="text-emphasis"><strong>ArrowDown</strong></span> pour le joueur de droite
pt_br: <span class="text-emphasis"><strong>Seta pra cima</strong></span> e <span class="text-emphasis"><strong>Seta pra baixo</strong></span> para o jogador da direita

source: Each game ends when a player riches <span class="text-emphasis"> <strong>%(points)s points</strong> </span>
fr: Chaque jeu se termine lorsqu'un joueur s'enrichit <span class="text-emphasis"> <strong>%(points)s points</strong> </span>
pt_br: Cada jogo termina quando um jogador faz <span class="text-emphasis"> <strong>%(points)s pontos</strong> </span>

source: Each game ends when the match total points riches <span class="text-emphasis"> <strong>%(points)s points</strong> </span>
fr: Chaque jeu se termine lorsque le total des points du match est riche <span class="text-emphasis"> <strong>%(points)s points</strong> </span>
pt_br: Cada jogo termina quando os pontos totais da partida chegam a <span class="text-emphasis"> <strong>%(points)s pontos</strong> </span>

source: Each game ends within
fr: Chaque jeu se termine en
pt_br: Cada jogo termina em

source: Enter the verification code for
fr: Entrez le code de vérification pour
pt_br: Digite o código de verificação para

source: Verify
fr: Vérifier
pt_br: Verificar

source: Resend code to email
fr: Renvoyer le code par e-mail
pt_br: Reenviar código para o e-mail

source: Game already validated
fr: Jeu déjà validé
pt_br: Jogo já validado

source: Your matches
fr: vos matchs
pt_br: Seus jogos

source: Result
fr: Résultat
pt_br: Resultado

source: Date / Status
fr: Date / Statut
pt_br: Data / Status

source: Duration
fr: Durée
pt_br: Duração

source: Winner
fr: Gagnant
pt_br: Vencedor

source: Play
fr: Jouer
pt_br: Jogar

source: Continue
fr: Continuer
pt_br: Continuar

source: Validate
fr: Valider
pt_br: Validar

source: Delete
fr: Supprimer
pt_br: Excluir

source: Cancel
fr: Annuler
pt_br: Cancelar

source: This user has no matches
fr: Cet utilisateur n'a pas de jeux
pt_br: Este usuário não possui jogos

source: No matches yet...
fr: Pas de jeux pour l'instant...
pt_br: Você ainda não tem jogos...

source: Success
fr: Succès
pt_br: Sucesso

source: Failed
fr: Échoué
pt_br: Falhou

source: %(name)s Tournament
fr: Tournoi %(name)s
pt_br: Torneio %(name)s

source: status: %(status)s
fr: statut: %(status)s

source: Validate Players
fr: Valider les joueurs
pt_br: Validar Jogadores

source: Instructions to play
fr: Instructions pour jouer
pt_br: Instruções

source: A win gives the player <span class="text-emphasis"><strong>3 rating points</strong></span>. A tie, <span class="text-emphasis"><strong>1 rating point</strong></span>.
fr: Une victoire donne au joueur <span class="text-emphasis"><strong>3 points de classement</strong></span>. Une égalité, <span class="text-emphasis"><strong>1 point de classement</strong></span>.
pt_br: Uma vitória soma <span class="text-emphasis"><strong>3 pontos</strong></span> na pontuação do torneio. Um empate, <span class="text-emphasis"><strong>1 ponto</strong></span>.

source: The tournament winner is the player with highest rating.
fr: Le gagnant du tournoi est le joueur ayant la note la plus élevée.
pt_br: O vencedor do torneio é o jogador com a pontuação mais alta.

source: In case of tie, the winner is determined by the one with more wins.
fr: En cas d'égalité, le gagnant est déterminé par celui ayant le plus de victoires.
pt_br: Em caso de empate, o vencedor é determinado pelo que tiver mais vitórias.

source: If there is still a tie, the winner is the one with more total points during tournament.
fr: S'il y a toujours égalité, le gagnant est celui ayant le plus de points totaux pendant le tournoi.
pt_br: Se ainda houver empate, o vencedor é o que tiver feito mais pontos nos jogos do torneio.

source: The default tournament type is <span class="text-emphasis"><strong>Round Robin</strong></span>. To played, it is necessary at least <span class="text-emphasis"><strong>3 players</strong></span>. <p class="small mb-0">In a Round Robin tournament all players play against each other</p>
fr: Le type de tournoi par défaut est <span class="text-emphasis"><strong>Tous Contre Tous</strong></span>. Pour jouer, il est nécessaire d'avoir au moins <span class="text-emphasis"><strong>3 joueurs</strong></span>. <p class="small mb-0">Dans un tournoi Tous Contre Tous, tous les joueurs jouent les uns contre les autres</p>
pt_br: O tipo padrão de torneio é <span class="text-emphasis"><strong>Todos contra Todos</strong></span>. Para jogar, são necessários pelo menos <span class="text-emphasis"><strong>3 jogadores</strong></span>. <p class="small mb-0">Como o nome diz, todos os jogadores jogam contra todos</p>

source: For <span class="text-emphasis"><strong>Round Robin</strong></span> tournament the <span class="text-emphasis"><strong>maximum number of players is 42</strong></span>.
fr: Pour un tournoi <span class="text-emphasis"><strong>Tous Contre Tous</strong></span> le <span class="text-emphasis"><strong>nombre maximum de joueurs est de 42</strong></span>.
pt_br: Para um torneio <span class="text-emphasis"><strong>Todos contra Todos</strong></span>, o <span class="text-emphasis"><strong>número máximo de jogadores é 42</strong></span>.

source: Optionally you can change the tournament type to <span class="text-emphasis"><strong>Challenge</strong></span>, which is played with only <span class="text-emphasis"><strong>2 players</strong></span>. <p class="small mb-0">A Challenge tournament is the type "Best of x", x being the total games.</p>
fr: En option, vous pouvez changer le type de tournoi en <span class="text-emphasis"><strong>Défi</strong></span>, qui se joue avec seulement <span class="text-emphasis"><strong>2 joueurs</strong></span>. <p class="small mb-0">Un tournoi de Défi est du type "Meilleur de x", où x est le nombre total de jeux.</p>
pt_br: Opcionalmente, você pode alterar o tipo de torneio para o tipo <span class="text-emphasis"><strong>Desafio</strong></span>, que é jogado com apenas <span class="text-emphasis"><strong>2 jogadores</strong></span>. <p class="small mb-0">Um torneio de Desafio é do tipo "Melhor de x", sendo x o número total de jogos.</p>

source: The <span class="text-emphasis"><strong>Round Robin</strong></span> tournament has an <span class="text-emphasis"><strong>auto calculated number of rounds</strong></span> accordind to the number of players.
fr: Le tournoi <span class="text-emphasis"><strong>Tous Contre Tous</strong></span> a un <span class="text-emphasis"><strong>nombre de rounds calculé automatiquement</strong></span> en fonction du nombre de joueurs.
pt_br: O torneio <span class="text-emphasis"><strong>Todos contra Todos</strong></span> tem um <span class="text-emphasis"><strong>número de rodadas calculado automaticamente</strong></span> de acordo com o número de jogadores.

source: For a <span class="text-emphasis"><strong>Challenge</strong></span> tournament the <span class="text-emphasis"><strong>minimum number of rounds is 3</strong></span>.
fr: Pour un tournoi de <span class="text-emphasis"><strong>Défi</strong></span>, le <span class="text-emphasis"><strong>nombre minimum de rounds est 3</strong></span>.
pt_br: Para um torneio do tipo <span class="text-emphasis"><strong>Desafio</strong></span>, o <span class="text-emphasis"><strong>número mínimo de rodadas é 3</strong></span>.

source: Each game ends when a player riches <span class="text-emphasis"><strong>11 points</strong></span>.
fr: Chaque jeu se termine lorsqu'un joueur gagne <span class="text-emphasis"><strong>11 points</strong></span>.
pt_br: Cada jogo termina quando um jogador faz <span class="text-emphasis"><strong>11 pontos</strong></span>.

source: You may customize this value or change how each game ends, considering:
fr: Vous pouvez personnaliser cette valeur ou modifier la façon dont chaque partie se termine, en tenant compte:
pt_br: Você pode personalizar este valor ou alterar como cada jogo termina, considerando:

source: Include players:
fr: Inclure les joueurs
pt_br: Incluir jogadores:

source: Rating Table
fr: Tableau de classement
pt_br: Classificação

source: Rank
fr: Classement
pt_br: Posição

source: Player
fr: Joueur
pt_br: Jogador

source: Total points
fr: Points totaux
pt_br: Total de pontos

source: Points/game
fr: Points par jeu
pt_br: Pontos por jogo

source: Winnings
fr: Gains
pt_br: Vitórias

source: Losses
fr: Pertes
pt_br: Derrotas

source: Ties
fr: Égalités
pt_br: Empates

source: A win gives the player <span class="text-emphasis"><strong>3 rating points</strong></span>. A tie, <span class="text-emphasis"><strong>1 rating point</strong></span>.
fr: Gagner donne au joueur <span class="text-emphasis"><strong>3 points de classement</strong></span>. Une égalité, <span class="text-emphasis"><strong>1 point de classement</strong></span>.
pt_br: Uma vitória dá ao jogador <span class="text-emphasis"><strong>3 pontos de classificação</strong></span>. Um empate, <span class="text-emphasis"><strong>1 ponto</strong></span>.

source: This is a <span class="text-emphasis"><strong>Round Robin</strong></span> tournament which means all players play against each other
fr: Il s'agit d'un tournoi en <span class="text-emphasis"><strong>Tous Contre Tous</strong></span>, où tous les joueurs jouent les uns contre les autres
pt_br: Este é um torneio do tipo <span class="text-emphasis"><strong>Todos contra Todos</strong></span>, no qual todos os jogadores jogam 1 vez contra cada um dos outros jogadores

source: This is a <span class="text-emphasis"><strong>Challenge</strong></span> tournament with %(rounds)s matches
fr: Il s'agit d'un tournoi de <span class="text-emphasis"><strong>Défi</strong></span> avec %(rounds)s matchs
pt_br: Este é um torneio do tipo <span class="text-emphasis"><strong>Desafio</strong></span> com %(rounds)s partidas

source: Each game ends when a player riches <span class="text-emphasis"> <strong>%(points)s points</strong> </span>
fr: Chaque jeu se termine lorsqu'un joueur atteint <span class="text-emphasis"> <strong>%(points)s points</strong> </span>
pt_br: Cada jogo termina quando um jogador faz <span class="text-emphasis"> <strong>%(points)s pontos</strong> </span>

source: Each game ends when the match total points riches <span class="text-emphasis"> <strong>%(points)s points</strong> </span>
fr: Chaque jeu se termine lorsque le total des points du match atteint <span class="text-emphasis"> <strong>%(points)s points</strong> </span>
pt_br: Cada jogo termina quando a soma dos pontos na partida chegam a <span class="text-emphasis"> <strong>%(points)s pontos</strong> </span>

source: Customize Tournament's Rules
fr: Personnaliser les règles du tournoi
pt_br: Personalizar as Regras do Torneio

source: Use Default Game Rules
fr: Utiliser les défaut règles
pt_br: Usar as Regras Padrão

source: Validate participants of %(name)s Tournament
fr: Valider les participants du tournoi %(name)s
pt_br: Validar os participantes do Torneio %(name)s

source: %(name)s Tournament Rules
fr: Règles du tournoi %(name)s
pt_br: Regras do Torneio %(name)s

source: <span class="text-emphasis"><strong>W</strong></span> and <span class="text-emphasis"><strong>S</strong></span> for left player
fr: <span class="text-emphasis"><strong>W</strong></span> et <span class="text-emphasis"><strong>S</strong></span> pour le joueur de gauche
pt_br: <span class="text-emphasis"><strong>W</strong></span> e <span class="text-emphasis"><strong>S</strong></span> para o jogador da esquerda

source: <span class="text-emphasis"><strong>ArrowUp</strong></span> and <span class="text-emphasis"><strong>ArrowDown</strong></span> for right player
fr: <span class="text-emphasis"><strong>flèche vers le haut</strong></span> et <span class="text-emphasis"><strong>flèche vers le bas</strong></span>pour le joueur de droite
pt_br: <span class="text-emphasis"><strong>seta pra cima</strong></span> e <span class="text-emphasis"><strong>seta pra baixo</strong></span> para o jogador da direita

source: Status
fr: Statut

source: Verification code
fr: Code de vérification
pt_br: Token de verificação

source: Owner
fr: Créateur
pt_br: Criador

source: Name
fr: Nom
pt_br: Nome

source: Type
fr: Taper
pt_br: Tipo

source: Players
fr: Joueurs
pt_br: Jogadores

source: Total Games
fr: Total des jeux
pt_br: Total de Jogos

source: Start
fr: Démarrer
pt_br: Começar

source: No tournaments registered
fr: Aucun tournoi enregistré
pt_br: Nenhum torneio registrado

source: insert username
fr: insérer nom d'utilisateur
pt_br: insera o username do usuário

source: anonymous
fr: anonyme
pt_br: anônimo

source: Score
pt_br: Pontuação

source: Score:
pt_br: Pontuação
